5MW/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-6;
        relTol          0.05;
    }

    Phi
    {
        $p;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "pcorr.*"
    {
        $p;
        tolerance       1e-5;
    }

    "(U|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;

        tolerance       1e-5;
        relTol          0.1;
    }

    "(U|k|epsilon)Final"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;

        tolerance       1e-6;
        relTol          0;
    }
}

potentialFlow
{
   nNonOrthogonalCorrectors 100;

}


PIMPLE
{
    momentumPredictor   yes;
    nOuterCorrectors    50;
    nCorrectors         1;
    nNonOrthogonalCorrectors 0;
    consistent          yes;

    outerCorrectorResidualControl
    {
        "(U|k|epsilon)"
        {
            relTol          0;
            tolerance       1e-5;
        }
    }

    turbOnFinalIterOnly yes;
}

relaxationFactors
{
//    "(p).*"             0.3;

     equations
     {
        "(U|k|epsilon).*"   0.9;
     }
}

cache
{
    grad(U);
}

// ************************************************************************* //
